twirescrape/app/controllers/players_controller.rb

  def index

    #puts current_user.username
    if params[:search] && params[:search].length > 0
      @players = Player.search(params)
      puts @players.length
---
SELECT "players".* FROM "players"
SELECT COUNT(*) FROM "players"

  def show
    @scrims_all = @player.player_scrim.first
    p @player.player_scrim.length
---
SELECT "player_scrims".* FROM "player_scrims" WHERE "player_scrims"."player_id" = $1 ORDER BY "player_scrims"."id" ASC LIMIT $2  [["player_id", 9757], ["LIMIT", 1]]
SELECT "player_scrims".* FROM "player_scrims" WHERE "player_scrims"."player_id" = $1  [["player_id", 9757]]