twirescrape/app/controllers/teams_controller.rb

  def index
    if params[:search] && params[:search].length > 0
      @teams = Team.search(params)
---
SELECT "teams".* FROM "teams"

  def show

    @scrims_all = @team.team_scrim.first
---
SELECT "team_scrims".* FROM "team_scrims" WHERE "team_scrims"."team_id" = $1 ORDER BY "team_scrims"."id" ASC LIMIT $2  [["team_id", 3322], ["LIMIT", 1]]

      puts 'test'
    end

    @scrims = @team.team_scrim.all.sort_by(&:scrim_id)
---
SELECT "team_scrims".* FROM "team_scrims" WHERE "team_scrims"."team_id" = $1  [["team_id", 3322]]