twirescrape/app/controllers/twire_link_controller.rb

SELECT "twire_links".* FROM "twire_links"
---
    def index
        @hubs = TwireLink.all